app/controllers/products_controller.rb

  def index
    @products = Product.order(:name)
---
SELECT "products".* FROM "products" ORDER BY name

  def create
    @product = Product.new(params[:product])
    if @product.save
---
INSERT INTO "products" ("contact", "created_at", "location", "manager", "name", "notes", "phone", "shelfSpace", "status", "updated_at", "userRating", "visited", "visted", "website", "ypRating", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)